myoa/models/User.php

SELECT * FROM `oa_user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        // TODO: Implement findIdentity() method.
        return static::findOne($id);