myoa/modules/back/controllers/OfficialController.php

    public function actionIndex() {
        //日程列表
        $where = ['id' => Yii::$app->user->id];
        $userModel = User::findOne($where);
        $count = $userModel->getOfficialList()->count();
---
SELECT count(*) FROM `oa_official`